
#include <stdio.h>

void menu1()
{
    printf("\033[2J\033[1;0H\033[33m");
    printf("\t\t\t*****西   安   邮   电   大   学\n");
    printf("\t\t\t                                                         爱   国   求   是   奋   进****\n\n\n\n");
    printf("\t\t\t~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~    欢迎进入管理员系统     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n\n\033[0m");
    printf("\t\t\t\t\t    『1』      --------------------------      创建新地图\n\n");
    printf("\t\t\t\t\t    『2』      --------------------------      添加新地点\n\n");
    printf("\t\t\t\t\t    『3』      --------------------------      撤销旧地点\n\n");
    printf("\t\t\t\t\t    『4』      --------------------------      添加新路线\n\n");
    printf("\t\t\t\t\t    『5』      --------------------------      撤销旧路线\n\n");
    printf("\t\t\t\t\t    『6』      --------------------------       深度遍历\n\n");
    printf("\t\t\t\t\t    『0』      --------------------------         退出\n");

}
