
#include <stdio.h>

void menu2()
{
    printf("\033[2J\033[1;0H\033[33m");
    printf("\t\t\t*****西   安   邮   电   大   学\n");
    printf("\t\t\t                                                         爱   国   求   是   奋   进****\n\n\n\n");
    printf("\t\t\t~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~    欢迎进入校园导游系统     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n\n\033[0m");
    printf("\t\t\t\t\t    『1』      --------------------------      校园平面图\n\n");
    printf("\t\t\t\t\t    『2』      --------------------------     地点信息查询\n\n");
    printf("\t\t\t\t\t    『3』      --------------------------       最短路径\n\n");
    printf("\t\t\t\t\t    『4』      --------------------------       所有路径\n\n");
    printf("\t\t\t\t\t    『5』      --------------------------     最佳布网方案\n\n");
    printf("\t\t\t\t\t    『0』      --------------------------         退出\n");

}
